class MyOpenLiveKey {
    /**
     * 如果你赶时间，直接[Ctrl]+[End]到最下面
     * 这些文字只是为了防止你无意中打开这个文件导致开发者密钥被人看到
     * 【但是其实真相是——主要是防止某喵录教程的时候发生事故】
     * 
     * 不管怎么说，这种强制谷歌浏览器工作在不检查CORS策略状态下
     * 并且把开发者密钥明文写死在文件里的工作方式
     * 都是不健康不合理不安全的
     * 
     * 反正要么你搞个后端完成签名，要么你可以进群踹一脚某喵借一下他的后端
     * 后端总是要有的，毕竟……
     * 
     * 不孝有三，无后为大
     * 
     * 
     * --------------
     * 
     * 
     * 某喵的OBS内嵌弹幕姬
     * https://play-live.bilibili.com/details/1651198829890
     * 
     * 某喵基于PlayWithMe.js的抽奖插件
     * https://play-live.bilibili.com/details/1653041209228
     * 
     * 某喵赶活动凑数的小玩意
     * https://open-live.bilibili.com/miniapp/overview/1653609820173
     * 
     * 广告位招租：
     * 加群 https://jq.qq.com/?_wv=1027&k=m7HSIvSC
     * 
     * 
     * --------------
     * 
     * 
     * 小时候都在幻想自己是个什么天选者，生来与众不同
     * 长大后呢，突然就开始发现自己早已默认自己是个普通人的现实，学会接受现实学的飞快
     *  
     * 08年的奥运会，10年的世博会，12年的末日谣言，14年的高中毕业
     * 贪玩的我，还没想好该怎么过这日子，我人生中最无忧无虑的时代就这样结束了
     * 那些年的记忆，模糊不清，处处留白，就好像自己是个按了快进穿越过来的人一样
     * 偶尔能隐隐约约猛然记起几个人，想起某些浑浑噩噩的日子，现在依然
     *  
     * 大概是12年上高中的时候吧，五六年前的那个盛夏
     * 在我家楼下，不知道是第多少次他送我回家的时候
     * 我答应了一个男孩，接受了他的表白
     *  
     * 这天下午，他在QQ上给我发了信息，说要分手
     * 连个电话都没打，只是发了一条信息
     * 他说家里不同意女方当警察，给他找了另一个，他拗不过
     *  
     * 真的是不愿意忤逆家里人么？
     * 其实答案已经再明显不过了
     *  
     * 不过我也确实没有再纠缠下去的意愿了，我累了，我并不是一个喜欢死缠烂打的人
     * 于是我回了一句：“好吧，祝大家都幸福”
     *  
     * 之后的消息，是妈妈发来的
     * 她问我方便语音吗，她刚忙完，需要等仪器一个小时后出报告
     * 我们在语音里聊了很多可有可无乱七八糟的絮叨
     *  
     * 我心里非常清楚，做刑警的妈妈并不是一个喜欢废话啰嗦的人
     * 她的每个鉴定报告，都可以作为警校的教科书案例，干净简洁的没有任何多余修饰，用词无比的准确缜密
     * 所以我最后决定放弃治疗，用一种打趣的语气试探着问她，为什么突然想起来跟我拉家常了
     *  
     * 她说她就是单纯突然觉得有必要给我打个电话
     * 她说你这傻孩子什么德行当妈的心里最清楚，她担心我碰上什么事情太难过想不开
     *  
     * “可能这就是母女之间的第六感吧”
     * 发觉气氛有点不对，她又慌张的用一种玩笑般语气试图掩饰，很小心很勉强的故作轻松的调侃着
     *  
     * 十二年前，爸爸离开了我们
     * 他在地下摇滚乐队的地下Live的后台调查大麻的来源时，被一个下手不知轻重的混混泼了汽油点燃了，从头到脚重度烧伤，只有后背还有一块是好的
     *  
     * 我们去看他的时候，一向从不落泪的妈妈也哭了
     * 她说他浑身上下的皮肤全部烤熟了，都在渗出体液
     * 护士抱他翻身的时候，甚至没用太大力气，一个壮的像个狗熊的汉子，居然就这样被一个护士和医生抬了起来
     * 说完我们母女俩就抱在一起，不约而同的大哭了起来
     * 大概是都觉得哭出来会好受一些
     *  
     * 在他得知自己基本用不了一个月就会死于严重的感染就会因为器官衰竭而死的时候
     * 他拔掉了自己的氧气管，与这个世界告了别
     * 我依旧不知道半个身子被烧焦的他是怎么做到的，又在这个过程中用怎样的意志力承受了多大的痛苦
     *  
     * 一开始我们都怪他为什么不撑到我们进到ICU里见他最后一面
     * 现在想想也能理解，他其实是害怕见了我们之后就不忍心离开，他清楚自己这样下去，即使医药费是国家来出，精神上也是会把家人和同志拖垮的
     * 他希望少给我们一些痛苦，也给自己留一份体面
     * 如果还有个理由，可能就是牺牲的话我们就是烈士家属了，赔偿金可能会比较高
     *  
     * 爸爸去世后，妈妈只会靠疯狂工作掩盖悲伤，把自己压抑的情绪，转化成对犯罪的仇恨
     * 整整一个月，她吃住都在警局的鉴定实验室里
     * 她至少为两个无辜的嫌疑人翻了案，又为十多件案子重新找到了关键物证和线索，以至于她的顶头上司秦局亲自下令押送她回家，没收了她的门卡
     *  
     * 他们怕她猝死在实验室里
     * 但是只休息了一个星期，妈妈就回去接着翻阅那堆如同小山一样的烂尾卷宗了
     * 只有我知道，是她不敢回家，家里到处都是爸爸留下的痕迹
     *  
     * 从那天起，妈妈就接替了爸爸的责任
     * 我也是那天才发觉，我这点怀春少女的思春期破事，我只说给了爸爸，他听完一笑的事
     * 她其实都知道
     *  
     * 于是我们母女俩聊了很多有的没的，我把刚刚分手的事情讲给了她听
     * 我破口大骂，说这种没良心的家伙，配不上我这种顶天立地的女侠，不要也罢
     * 似乎是真的相信我彻底放下了，也可能是她老人家只是想配合我的表演
     * 妈妈附和了我几句，便又开始转移话题，不再提我的感情生活了
     *  
     * 之后又是一段突兀的沉默，有足足半分钟的时间找不到话题
     * 因为我脑子里想的全是第一次带他回家被父母堵在家里的时候，妈妈夸他是个不错的小伙子
     *  
     * 我知道我现在再这样下去又会让妈妈担心
     * 我不知道该说写什么，只能做作的打个哈欠，假装自己困了，说要回去睡觉了
     * 说了句“晚安妈妈”，挂掉了语音，然后自己蹲在路边莫名其妙的哭了起来
     *  
     * 那天的雨下的半大不小，我在凌晨穿好衣服，撑着自己破了半边的赠品雨伞去了很远的一个小超市，买了很多并不廉价的垃圾食品，打算回去之后用这五天假期让自己没心没肺的在网游和论坛里放浪一场
     * 我一直努力思考着怎样才能调节好自己，我害怕自己情绪失控，我觉得我真的可能会疯掉
     *  
     * 然而回到小区走到楼下的时候，一直正在亭子里避雨的黑猫引起了我的注意
     * 小区里确实有很多流浪猫，被大妈们投食喂养着，被我们戏称为“云养猫”
     * 但是这只不一样……
     *  
     * 它并没有躺在椅子上，也没有趴在围栏旁，而是静静的坐在那个被老人们用油漆画出了棋盘的石桌上，像一颗定盘的棋子
     * 它听见了我的脚步声，回头漫不经心的瞟了我一眼，又望向了雨中的某个方向
     *  
     * 或许我当时的脑子真的出了点什么问题，我就这样拎着东西走了过去，坐在了它的身边
     * 它没有逃走，这让我很诧异，或许是讨厌身上被淋湿吧，毕竟猫都很怕水嘛
     * 我撕开了一袋薯片放在桌子上，故意把口子撕的很大，然后就在桌子上吃了起来
     * 它依旧无动于衷，连闻都没有闻一下
     *  
     * 我倒了一点牛奶，在废弃的空袋子里，它没喝
     * 撕了一小块烤鱼片给它，它也没理我
     * 
     * 大概是真的失了智吧，我开始试着跟它说话
     * 它还是望着雨夜里的远方，只有偶尔轮流转过来的小耳朵告诉我它在听
     * 那一整天，我都非常难过，非常孤独
     * 我不知道该向谁倾诉，唯恐自己的悲伤，影响了真心关爱着自己的人
     * 
     * 于是我把我全部的伤心事，都讲给了一只猫听
     * 像个傻子一样自言自语，一直从子夜时分讲到了天亮
     * 这大概是我来到这世上这二十多年，最孤独的一天了
     * 
     * 记得当时，我开薯片，倒牛奶，请它吃烤鱼片
     * 只是希望它别走，别离开我，让我有个可以说话的对象而已
     * 感谢它，听完了全程
     * 
     * 
     * 
     * 
     * 
     * 
     */
    static AccessKey = "";
    static SecretKey = "";
}